디자인 패턴
	생성 패턴
		추상 팩토리 - 구상 클래스들을 지정하지 않고도 관련 객체들의 모음을 생성 가능 (의존적인 객체 조합)
		빌더 - 단계별로 생성하도록 만듬 (복잡한 인스턴스 조립, 생성)
		팩토리 메소드 - 부모 클래스 객체 생성 인터페이스 제공, 자식 클래스는 생성될 객체들의 유형을 변경 가능
		프로토타입 - 기존 객체들을 복사할 수 있도록함 (복제 및 필요한 부분 수정)
		싱글톤 - 클래스에 인스턴스가 한개, 인스턴스에 대한 전역 접근 지점을 제공 (한 클래스에 한 객체만)

	구조 패턴
		어뎁터 - 호환되지 않는 인터페이스를 가진 객체들이 협업할 수 있도록함 (기존 클래스 재사용, 덧씌움)
		브릿지 - 클래스들의 집합을 두개의 개별 계층 구조로 나누어 독립적으로 개발 (구현부, 추상부 분리)
		컴포지트 - 객체들을 트리 구조들로 구성, 구조들과 개별 객체들처럼 작업할 수 있도록하는 구조
		데코레이트 - 새로운 행동들을 포함한 특수래퍼 객체들 내에 넣어서 행동들을 해당 객체들이 연결
		퍼싸드 - 복잡한 집합에 대한 단순화된 인터페이스 제공
		플라이웨이트 -여러 객체들 간에 상태의 공통 부분들을 공유하여 사용 (유사 객체 메모리 사용량 최소화)
		프록시 - 접근이 힘든 객체에 대한 대체 or 자리표시자 제공

	행위 패턴
		M 중간자 - 객체간 의존 관계 줄일 수 있음, 중간자를 통해서 객체 간 통신 가능
		S 상태 - 객체의 상태가 변경될 때 객체가 행동을 변경할 수 있도록함
		O 옵서버 - 관찰 중인 객체에 발생하는 모든 이벤트 수집
		S 전략 - 알고리즘의 그룹 정의, 각 그룹에 클래스를 넣고 클래스의 객체 끼리 상호교환
		I 인터프리터 - 분리된 구문의 해석을 맡는 클래스를 작성 (여러 언어 구문을 해석 가능) 
		C 책임 연쇄 - 핸들러들의 체인을 따라 요청을 전달할 수 있음(처리 못하면 다음 체인으로)
		T 템플릿 메소드 - 부모 클래스에 알고리즘 골격 정의, 자식 클래스들이 재정이 함
		M 메멘토 - 객체 세부 사항을 공개하지 않고 복원할 수 있게 해줌
		I 반복자 - 요소들을 노출하지 않고 그것들을 순회할 수 있음
		V 방문자 - 알고리즘들을 작동하는 개체들로부터 분리 가능
		C 커맨드 - 요청에 대한 모든 정보가 포함된 독립실행형 객체로 변환

암호화 알고리즘
SEED - kisa 블록 128, 키 128, 256
AIRA - 국가 정보원, 산악연협회
DES - 블록 64, 키 56
AES - 블록 128, 키 128, 192, 256
RSA - 공개키 소인수 분해
IDEA - 라이와 메시 블록 64, 128
skipjack - NSA, IC칩 내장,음성 통신 장비 삽입 블록 64, 키 80
TKIP - WEP 보완, 패킷당 키할당, 키 값 재설정 키 128

해시
SHA - NSA 개발
MD5 - 블록 512, 키 길이128
N-NASH - 일본의 전신전화주식회사 개발 블록, 키 128
SNEFRU - R.C.Merkle 개발 32비트 프로세서에서 구현을 용이하게 할 목적

DB 트랜잭션 연산
REDO - DB 비정상적으로 종료되었을때 로그 이용, 이전 값을 이후 값으로 변경
UNDO -  DB 비정상적으로 종료되었을때 로그 이용, 이후 값을 이전 값으로 변경

AAA서버
Authentication - 사용자 신원 검증
Authorization - 신원 검증된 사용자에게 특정된 권한과 서비스 허용
Accounting - 사용자가 어떤 종류의 서비스를 이용, 얼마만큼의 자원을 사용했는지 기록 및 보관하는 기능

UML - 표준화한 객체지향 모델링 언어
럼바우, 부치, 제콥슨 객체지향 방법론의 장점 통합

사물
	구조
	행동
	그룹
	주해

관계
	연관
	집합
	포함
	일반화
	의존
	실체화

다이어그램
	구조적 다이어그램
		클래스 다이어 그램
			클래스
				이름
				속성
				오퍼레이션
			제약조건
			관계
		객체 다이어그램
		컴포넌트 다이어그램
		배치 다이어그램
		복합체 구조 다이어그램
		패키지 다이어그램
	
	행위 다이어그램
		유스케이스 다이어그램
			시스템
			액터
			유스케이스
			관계
		순차 다이어그램
			액터
			객체
			생명선
			실행상자
			메시지
			객체 소멸
			프레임
		커뮤니케이션 다이어그램
			액터
			객체
			링크
			메시지
		상태 다이어그램
			상태
			시작 상태
			종료 상태
			상태 전환
			이벤트
			프레임
		활동 다이어그램
			액션/액티비티
			시작 노드
			종료 노드
			조건 노드
			병합 노드
			포크 노드
			조인 노드
			스윔레인
		상호작용 개요 다이어그램
		타이밍 다이어그램

정적 모델링
기능 모델링
동적 모델링

비용 산정 기법
	하향식
		전문가 감정 기법
		델파이 기법

	상향식
		LOC 기법
		개발 단계별 인월수 기법
		수학적 산정 기법

	COCOMO 모형 - LOC에 의한 비용 산정 기법
		개발 유형
			조직형
			반분리형
			내장형

		모형 종류
			기본형
			중간형
			발전형

	푸트남 모형
		푸트남 제안
		대형 프로젝트의 노력 분포 산정 이용

	기능 점수(FP)
		알브레이히트 제안
		
비용 산정 자동화 추정 도구
	SLIM - 푸트남 예측 모델 기초 
	ESTIMACS - FP 모델 기초

SW 개발 프레임워크
	종류 
		스프링 프레임워크
		전자정부 프레임워크
		닷넷 프레임워크

	특성
		모듈화
		재사용성
		확장성
		제어의 역흐름

이상
	삽입 이상
	삭제 이상
	갱신 이상

함수적 종속
	완전 함수적 종속
	부분 함수적 종속
	완전/부분 함수적 종속
	이행적 함수적 종속

정규화
	도메인이 원자값
	부분적 함수 종속 제거
	이행적 함수 종속 제거
	결정자이면서 후보키가 아닌 것 제거
	다치 종속 제거
	조인 종속성 이용

반정규화 - 정규화된 데이터 모델을 의도적으로 통합, 중복, 분리하여 사용

인덱스 - 데이터 레코드를 빠르게 접근하기 위해여 키 값, 포인터 쌍으로 구성
뷰 - 하나 이상의 기본 테이블로부터 유도된 가상 테이블
클러스트 - 동일한 성격의 데이터를 동일한 데이터 블록에 저장
파티션 - 대용량의 테이블이나 인덱스의 작은 논리적 단위

모듈
	결합도
		내용 결합도 - 다른 모듈의 내부 기능 및 내부 자료를 직접 참조, 수정
		공통 결합도 - 공유되는 공통 데이터 영역을 여러 모듈이 사용
		외부 결합도 - 외부의 다른 모듈에서 참조
		제어 결합도 - 논리적인 흐름을 제어 신호나 제어 요소 전달
		스탬프 결합도 - 인터페이스로 배열이나 레코드 등의 자료 구조 전달(자료 구조 전달)
		자료 결합도 - 인터페이스가 자료 요소로만 구성될 때의 결합도(자료로만 전달)

	응집도
		기능적 응집도 - 내부 모든 기능 요소들이 단일 문제와 연관되어 수행
		순차적 응집도 - 모듈 내 나온 출력데이터를 그 다음 입력 데이터로 사용할 경우
		교환적 응집도 - 동일한 입력과 출력을 사용하여 서로 다른 기능을 수행하는 구성요소들이 모였을때의 경우
		절차적 응집도 - 다수의 관련 기능을 가질 때 모듈 내의 구성요소들이 기능을 순차적으로 수행할 경우
		시간적 응집도 - 특정 시간 처리되는 기능을 모아 하나의 모듈로 작성할 경우
		논리적 응집도 - 유사한 성격의 처리 요소들로 하나의 모듈이 형성되는 경우
		우연적 응집도 - 서로 관련 없는 요소로만 구성된 경우

회복
	연기 갱신 기법 - 트랜잭션이 성공적으로 완료될 때까지 데이터베이스에 대한 실질적인 갱신 연기
	즉각 갱신 기법 - 데이터를 갱신하면 트랜잭션이 부분 완료되기 전이라도 즉시 실제 데이터 베이스 반영
	그림자 페이지 대체 기법 - 갱신 이전 데이터 베이스를 페이지 단위로 구성, 장애 시 그림자 페이지로 대체
	검사점 기법 - 특정 단계에서 재실행할 수 있도록 로그 보관, 장애 시 검사점부터 회복 작업 수행
	
병행제어
	로킹 - 락을 요청해서 락이 허락되어야만 로킹 단위를 액세스 할 수 있는 기법
	타임 스탬프 순서 - 시간표를 부여하여 부여된 시간에 따라 트랜잭션 작업 수행
	최적 병행 수행 - 대부분의 트랜잭션이 판독 전용 트랜잭션으로 만듬
	다중 버전 기법 - 타임 스탬프 개념 이용

ALTER TABLE ~ ADD ~
GRANT ~ TO ~
REVOKE ~ ON ~
INSERT INTO ~ VALUES
UPADTE ~ SET ~ WHERE
DELETE ~ FROM ~ WHERE
SELECT ~ FROM ~ WHERE
ORDER BY ~ ASC
GROUP BY ~
HAVING ~

SELECT ~ FROM ~ LEFT OUTER JOIN ~ ON
SELECT ~ FROM ~ RIGHT OUTER JOIN ~ ON
SELECT ~ FROM ~ FULL OUTER JOIN ~ ON

SW 관련 신기술
	인공지능 - 인간지능적인 작업을 수행하는 시스템
		ex) 패턴 인식, 전문가 시스템, 로봇 공학 등
	뉴럴링크 - 신경 레이스로 작은 전극을 뇌에 이식함으로써 생각을 업로드하고 다운로드하는 것을 목표로 삼음
	딥 러닝 - 인간의 두뇌를 모델로 만들어진 인공 신경망을 기반으로 기계 학습 기술
	전문가 시스템 - 의료 진단 들과 같은 특정 분야의 전문가가 수행하는 고도의 업무를 지원하기 위한 컴퓨터 응용 프로그램
	증강현실(AR) - 실제 촬영한 화면에 가상의 정보를 부가하여 보여주는 기술, (혼합 현실)
	블록체인 - P2P 네트워크를 이용하여 온라인 금융 거래 정보를 온라인 네트워크 참여자의 디지털 장비에 분산 저장
	분산 원장 기술(DLT) - 중앙 관리자나 중앙 데이터 저장소가 존재하지 않고 P2P 망내의 참여자들에게 모든 거래 목록이 분산 저장되어 거래가 발생할 때마다 지속적으로 갱신되는 디지털 원장 의미
	해시 - 임의의 길이의 입력 데이터나 메시지를 고정된 길이의 값이나 키로 변환
	양자 암호키 분배(QKD) - 양자 통신을 위해 비밀키를 분배하여 관리하는 기술
				비밀키를 공유하기위해 양자 암호키 분배 시스템을 설치 운용
	프라이버시 강화 기술(PET) - 개인정보 침해 위험을 관리하기 위한 핵심 기술
	공통 평가 기준(CC) - 정보보호 제품 평가 기준
				정보화 순기능 역할을 보장하기 위해 정보화 제품의 정보보호 기능과 이에 대한 사용 환경 등급을 정한 기준
	개인정보 영향평가(PIA) - 개인 정보를 활용하는 새로운 정보 시스템의 도입 및 기존 정보시스템의 중요한 변경 시 시스템의 구축, 운영이 기업의 고객은 물론 국민의 사생활에 미칠 영향에 대해 미리 조사, 분석, 평가하는 제도
	그레이웨이 - 소프트웨어를 제공하는 입장에서는 악의적이지 않은 유용한 소프트웨어라고 주장할 수 있지만 사용자 입장에서는 유용할 수도 있고 악의적일 수도 있는 악성코드나 악성 공유웨어
	매시업 - 다수의 정보원이 제공하는 콘텐츠를 조합하여 하나의 서비스로 제공하는 웹 사이트 또는 어플리케이션
	리치 인터넷 애플리케이션(RIA) - 플래시 애니메이션 기술과 웹 서버 애플리케이션 기술을 통합하여 기존 HTML보다 역동적이고 인터랙티브한 웹 페이지를 제공하는 신개념의 플래시 웹 페이지 제작 기술
	시맨틱 웹 - 컴퓨터가 사람을 대신하여 정보를 읽고 이해하고 가공하여 새로운 정보를 만들어 낼 수 있도록 이해하기 쉬운 의미를 가진 차세대 지능형 웹
	증발품 - 판매 계획 또는 배포 계획은 발표되었으나 실제로 고객에게 판매되거나 배포되지 않고 있는 SW
	오픈 그리드 서비스 아키텍처(OGSA) - 애플리케이션 공유를 위한 웹 서비스를 그리드 상에서 제공하기 위해 만든 개방형 표준
	서비스 지향 아키텍처(SOA) - 기업 소프트웨어 인프라인 정보시스템을 공유와 재사용이 가능한 서비스 단위나 컴포넌트 중심으로 구축하는 정보기술 아키텍처
				구성 계층
					-표현 계층
					-업무 프로세스 계층
					-서비스 중간 계층
					-애플리케이션 계층
					-데이터 저장 계층
	서비스형 소프트웨어(SaaS) - 소프트웨어의 여러 기능 중에서 사용자가 필요로 하는 서비스만 이용할 수 있도록 한 소프트웨어
	소프트웨어 에스크로 - 사용자는 저렴한 비용으로 소프트웨어를 안정적으로 사용 및 유지보수 할 수 있도록 소스 프로그램과 기술 정보 등을 제 3의 기관에 보관
	복잡 이벤트 처리(CEP) - 실시간으로 발생하는 많은 사건들 중 의미가 있는 것만을 추출할 수 있도록 사건 발생 조건을 정의하는 데이터 처리 방법
	디지털 트윈 - 현실속의 사물을 소프트웨어로 가상화한 모델
			실제 물리적인 자산을 소프트웨어로 가상화함으로써 실제 자산의 특성에 대한 정확한 정보를 얻을 수 있음
			자산 최적화, 돌발사고 최소화, 생산성 증가 등 설계부터 제조, 서비스에 이르는 모든 과정의 효율성을 향상

네트워크 관련 신기술
	M2M - 무선 통신을 이용한 기계와 기계 사이 통신
	클라우드 컴퓨팅 - 컴퓨팅 자원을 중앙 컴퓨터에 두고 인터넷 기능으로 중앙 컴퓨터 제어
	그리드 컴퓨팅 - 분산되어 있는 컴퓨터를 초고속 인터넷망으로 연결하여 공유함으로써 하나의 고성능 컴퓨터처럼 활용하는 기술
	인터클라우드 컴퓨팅 - 각기 다른 클라우드 서비스를 연동하거나 컴퓨팅 자원의 동적 할당이 가능하도록 여러 클라우드 서비스 제공자들이 제공하는 클라우드 서비스나 자원을 연결하는 기술
	메시 네트워크 - 차세대 이동통신, 홈네트워킹, 공공 안전 등 특수 목적을 위한 새로운 방식의 네트워크 기술, 대규모 디바이스의 네트워크 생성에 최적화
	와이선 - 스마트 그리드와 같은 장거리 무선통신을 필요로 하는 사물 인터넷 서비스를 위한 저전력 장거리 통신 기술
	NDN - 콘텐츠 자체의 정보와 라우터 기능만으로 데이터 전송을 수행
	NGN - 유선망 기반의 차세대 통신망, 이동 사용자를 목표로하며, 이동통신에서 제공하는 완전한 이동성 제공에 목표 개발
	SDN - 네트워크를 컴퓨터처럼 모델링하여 여러 사용자가 각각의 소프트웨어로 네트워킹을 가상화하여 제어 관리
	NFC - 고주파를 이용한 근거리 무선 통신 기술, 아주 가까운 거리에서 RFID
	UWB - 저전력으로 많은 양의 데이터를 멀리전송, 땅속 or 벽면 뒤로도 전송 가능
	피코넷 - 여러 개의 독립된 통신장치가 블루투스 기술이나 UWB통신 기술을 사용하여 통신망을 형성하는 무선 네트워크 기술
	WBAN - 웨어러블 또는 몸에 심는 형태의 센서나 기기를 무선으로 연결하는 개인 영역 네트워킹 기술
	GIS - 지리적인 자료를 수집, 저장, 분석, 출력할 수 있는 컴퓨터 응용 시스템
	USN - 각 센서로 수집한 정보를 무선으로 수집할 수 있는 네트워크
	SON - 주변 상황에 맞춰 스스로 망을 구성하는 네트워크, 통신망 커버리지 및 전송 용량 확장의 경제성 문제 해결, 망의 운영과 관리의 효율성을 높이는 것
	애드 훅 네트워크 - 모바일 호스트만을 이용하여 구성, 망을 구성한 후 단기간 사용되는 경우나 유선망을 구성하기 어려운 경우
	네트워크 슬라이싱 - 물리적인 코어 네트워크 인프라를 독립된 다수의 가상 네트워크로 분리하여 각각의 네트워크를 통해 다양한 고객 맞춤형 서비스를 제공하는 것을 목적
	저전력 블루투스 기술 - 연결되지 않은 대기 상태에서는 절전모드를 유지
	지능형 초연결망 - 급격하게 증가하는 데이터 트래픽을 효과적으로 수용하기 위해 시행되는 사업
	파장 분할 다중화 - 광섬유를 이용한 통신기술, 서로 다른 복수의 신호를 보냄, 여러 대의 말기가 동시에 통신 회선을 사용
	소프트웨어 정의 데이터(SDDC) - 모든 자원 가상화하여 인력의 개입없이 소프트웨어 조작만으로 관리 및 제어되는 데이터 센터를 의미
	개방형 링크드 데이터(LOD) - 사용할 수 있도록 웹상에 공개된 연계 데이터를 의미
	SSO - 한 번의 로그인으로 개인이 가입한 모든 사이트를 이용할 수 있게 해주는 시스템

